>>> double quotes for title
links [are](http://foo.com "woo") awesome

<<<
<p>links <a href="http://foo.com" title="woo">are</a> awesome</p>
>>> no title
links [are](http://foo.com) awesome

<<<
<p>links <a href="http://foo.com">are</a> awesome</p>
>>> can style link contents
links [*are*](http://foo.com) awesome

<<<
<p>links <a href="http://foo.com"><em>are</em></a> awesome</p>
>>> no URL
links [are]() awesome

<<<
<p>links <a href="">are</a> awesome</p>
>>> URL wrapped in angle brackets
links [are](<http://example.com>) awesome

<<<
<p>links <a href="http://example.com">are</a> awesome</p>
>>> multi-line link
links [are
awesome](<http://example.com>).

<<<
<p>links <a href="http://example.com">are
awesome</a>.</p>
>>> multi-line link with a title
links [are](http://foo.com
"woo") awesome

<<<
<p>links <a href="http://foo.com" title="woo">are</a> awesome</p>
>>> not a real link
links [are] (http://foo.com) awesome

<<<
<p>links [are] (http://foo.com) awesome</p>
